-- ==========================================
-- リモコン受信信号の定義 (J-MX100RC)
-- ==========================================
local BUTTONS = {}
BUTTONS.type = "IR"
BUTTONS.keys = {
  -- 最上段
  MUTE         = "02:20:00:80:ea:10:ef", -- 消音
  POWER        = "02:20:00:80:ea:12:ed", -- 電源

  -- 数字キー (放送波共通)
  NUM_1 = "02:20:00:80:ea:01:fe", NUM_2 = "02:20:00:80:ea:02:fd", NUM_3 = "02:20:00:80:ea:03:fc",
  NUM_4 = "02:20:00:80:ea:04:fb", NUM_5 = "02:20:00:80:ea:05:fa", NUM_6 = "02:20:00:80:ea:06:f9",
  NUM_7 = "02:20:00:80:ea:07:f8", NUM_8 = "02:20:00:80:ea:08:f7", NUM_9 = "02:20:00:80:ea:09:f6",
  NUM_10 = "02:20:00:80:ea:0a:f5", NUM_11 = "02:20:00:80:ea:0b:f4", NUM_12 = "02:20:00:80:ea:0c:f3",

  -- 放送切換・番組表
  MODE_DIGITAL = "02:20:00:80:ea:44:bb", -- 地デジ
  MODE_BS      = "02:20:00:80:ea:7c:83", -- BS
  MODE_CS      = "02:20:00:80:ea:7d:82", -- CS
  GUIDE        = "02:20:00:80:ea:5e:a1", -- 番組表

  -- 中央操作エリア
  VOL_UP       = "02:20:00:80:ea:1a:e5",
  VOL_DOWN     = "02:20:00:80:ea:1e:e1",
  INPUT_SELECT = "02:20:00:80:ea:0f:f0", -- 入力切換
  SCREEN_DISP  = "02:20:00:80:ea:1c:e3", -- 画面表示
  PROGRAM_INFO = "02:20:00:80:ea:41:be", -- 番組説明
  CH_UP        = "02:20:00:80:ea:1b:e4",
  CH_DOWN      = "02:20:00:80:ea:1f:e0",

  -- メニュー・設定系
  MENU         = "02:20:00:80:ea:50:af", -- サブメニュー
  SETTING      = "02:20:00:80:ea:53:ac", -- 設定
  RETURN       = "02:20:00:80:ea:4b:b4", -- 戻る
  EXIT         = "02:20:00:80:ea:3c:c3", -- 終了

  -- 方向キー・決定
  UP = "02:20:00:80:ea:4e:b1", DOWN = "02:20:00:80:ea:4f:b0", 
  LEFT = "02:20:00:80:ea:5f:a0", RIGHT = "02:20:00:80:ea:5b:a4", 
  ENTER = "02:20:00:80:ea:5d:a2",

  -- 下部機能ボタン
  DATA         = "02:20:00:80:ea:14:eb", -- dデータ
  SUBTITLE     = "02:20:00:80:ea:52:ad", -- 字幕
  AUDIO_SELECT = "02:20:00:80:ea:13:ec", -- 音声切換

  -- カラーボタン
  BLUE = "02:20:00:80:ea:73:8c", RED = "02:20:00:80:ea:74:8b", 
  GREEN = "02:20:00:80:ea:75:8a", YELLOW = "02:20:00:80:ea:76:89",

  -- 再生・録画操作エリア
  PREV_SKIP    = "02:20:00:80:ea:6d:92", -- 前スキップ
  NEXT_SKIP    = "02:20:00:80:ea:6e:91", -- 次スキップ
  REC_LIST     = "02:20:00:80:ea:28:d7", -- 録画リスト
  BACK_10S     = "02:20:00:80:ea:22:dd", -- 10秒戻し
  PLAY         = "02:20:00:80:ea:66:99", -- 再生 (早見早聞)
  REWIND       = "02:20:00:80:ea:69:96", -- 早戻し
  STOP         = "02:20:00:80:ea:67:98", -- 停止
  FAST_FORWARD = "02:20:00:80:ea:6a:95", -- 早送り
  PAUSE        = "02:20:00:80:ea:68:97", -- 静止
  SKIP_30S     = "02:20:00:80:ea:23:dc", -- 30秒送り
}

return BUTTONS
