-- ==========================================
-- リモコン受信信号の定義 (maxell RC-R2)
-- ==========================================
local BUTTONS = {}
BUTTONS.type = "IR"
BUTTONS.keys = {
  -- 最上段
  POWER        = "02:20:00:86:ff:00:ff", -- 電源
  SCREEN_DISP  = "02:20:00:86:ff:03:fc", -- 画面表示
  AUDIO_SELECT = "02:20:00:86:ff:0a:f5", -- 音声切換
  TV_POWER     = "02:20:00:50:af:17:e8", -- TV電源
  
  -- 放送切換・入力
  MODE_DIGITAL = "02:20:00:86:ff:90:6f", -- 地デジ
  MODE_BS      = "02:20:00:86:ff:8e:71", -- BS
  MODE_CS      = "02:20:00:86:ff:8f:70", -- CS
  -- MODE_TV は赤外線を発信しないため削除

  -- 数字キー (放送波共通)
  NUM_1 = "02:20:00:86:ff:11:ee", NUM_2 = "02:20:00:86:ff:12:ed", NUM_3 = "02:20:00:86:ff:13:ec",
  NUM_4 = "02:20:00:86:ff:14:eb", NUM_5 = "02:20:00:86:ff:15:ea", NUM_6 = "02:20:00:86:ff:16:e9",
  NUM_7 = "02:20:00:86:ff:17:e8", NUM_8 = "02:20:00:86:ff:18:e7", NUM_9 = "02:20:00:86:ff:19:e6",
  NUM_10 = "02:20:00:86:ff:1a:e5", NUM_11 = "02:20:00:86:ff:91:6e", NUM_12 = "02:20:00:86:ff:92:6d",

  -- 中央操作エリア
  VOL_UP       = "02:20:00:50:af:12:ed",
  VOL_DOWN     = "02:20:00:50:af:15:ea",
  CH_ENTRY     = "02:20:00:86:ff:1b:e4", -- Ch番号入力
  INPUT_SELECT = "02:20:00:50:af:09:f6", -- TV入力切換
  CH_UP        = "02:20:00:86:ff:0e:f1",
  CH_DOWN      = "02:20:00:86:ff:0d:f2",

  -- メニュー・番組表
  GUIDE        = "02:20:00:86:ff:95:6a", -- 番組表
  SEARCH       = "02:20:00:86:ff:a0:5f", -- さがす
  REC_LIST     = "02:20:00:86:ff:06:f9", -- 見る
  PROGRAM_INFO = "02:20:00:86:ff:96:69", -- 番組説明
  INTERNET     = "02:20:00:86:ff:a1:5e", -- ネット
  MENU         = "02:20:00:86:ff:07:f8", -- メニュー
  RETURN       = "02:20:00:86:ff:10:ef", -- 戻る

  -- 方向キー・決定
  UP = "02:20:00:86:ff:0b:f4", DOWN = "02:20:00:86:ff:0c:f3", 
  LEFT = "02:20:00:86:ff:a3:5c", RIGHT = "02:20:00:86:ff:a2:5d", 
  ENTER = "02:20:00:86:ff:0f:f0",

  -- カラーボタン
  BLUE = "02:20:00:86:ff:a4:5b", RED = "02:20:00:86:ff:a5:5a", 
  GREEN = "02:20:00:86:ff:a6:59", YELLOW = "02:20:00:86:ff:a7:58",

  -- 再生・録画操作エリア
  DATA         = "02:20:00:86:ff:a8:57", -- dデータ
  SUB_CH       = "02:20:00:86:ff:a9:56", -- 裏番組
  REWIND       = "02:20:00:86:ff:26:d9", -- 早戻し
  PLAY         = "02:20:00:86:ff:1f:e0", -- 再生
  FAST_FORWARD = "02:20:00:86:ff:23:dc", -- 早送り
  PREV_SKIP    = "02:20:00:86:ff:ab:54", -- 前スキップ
  PAUSE        = "02:20:00:86:ff:20:df", -- 一時停止
  NEXT_SKIP    = "02:20:00:86:ff:aa:55", -- 次スキップ
  BACK_10S     = "02:20:00:86:ff:9e:61", -- 10秒バック
  STOP         = "02:20:00:86:ff:1e:e1", -- 停止
  SKIP_30S     = "02:20:00:86:ff:9d:62", -- 30秒スキップ
  REC_MODE     = "02:20:00:86:ff:ac:53", -- 録画モード
  REC          = "02:20:00:86:ff:80:7f", -- 録画
  SUBTITLE     = "02:20:00:86:ff:ad:52", -- 字幕
}

return BUTTONS
