-- ==========================================
-- リモコン送信信号の定義 (HDMI-CEC)
-- ==========================================
local BUTTONS = {}
BUTTONS.type = "CEC"
BUTTONS.keys = {
  -- 最上段
  MUTE  = "10:44:43", -- 消音
  -- POWER = "", -- 電源

  -- 数字キー (放送波共通)
  NUM_1 = "10:44:21", NUM_2 = "10:44:22", NUM_3 = "10:44:23",
  NUM_4 = "10:44:24", NUM_5 = "10:44:25", NUM_6 = "10:44:26",
  NUM_7 = "10:44:27", NUM_8 = "10:44:28", NUM_9 = "10:44:29",
  NUM_10 = "10:44:20",

  -- 放送切換・番組表
  -- MODE_DIGITAL = "10:44:", -- 地デジ
  -- MODE_BS      = "10:44:", -- BS
  -- MODE_CS      = "10:44:", -- CS
  GUIDE        = "10:44:53", -- 番組表

  -- 中央操作エリア
  VOL_UP       = "10:44:41",
  VOL_DOWN     = "10:44:42",
  INPUT_SELECT = "10:44:34", -- 入力切換
  SCREEN_DISP  = "10:44:35", -- 画面表示
  -- PROGRAM_INFO = "", -- 番組説明
  CH_UP        = "10:44:30",
  CH_DOWN      = "10:44:31",

  -- メニュー・設定系
  -- MENU         = "", -- サブメニュー
  SETTING      = "10:44:0A", -- 設定
  RETURN       = "10:44:0D", -- 戻る
  -- EXIT         = "", -- 終了

  -- 方向キー・決定
  UP    = "10:44:01", 
  DOWN  = "10:44:02", 
  LEFT  = "10:44:03", 
  RIGHT = "10:44:04", 
  ENTER = "10:44:00",

  -- 下部機能ボタン
  DATA         = "10:44:76", -- dデータ
  -- SUBTITLE     = "", -- 字幕
  -- AUDIO_SELECT = "10:44:33", -- 音声切換

  -- カラーボタン
  BLUE   = "10:44:71",
  RED    = "10:44:72", 
  GREEN  = "10:44:73",
  YELLOW = "10:44:74",

  -- 再生・録画操作エリア
  PREV_SKIP    = "10:44:4C", -- 前スキップ
  NEXT_SKIP    = "10:44:4B", -- 次スキップ
  REC_LIST     = "10:44:0B", -- 録画リスト
  -- BACK_10S     = "", -- 10秒戻し
  PLAY         = "10:44:44", -- 再生 (早見早聞)
  REWIND       = "10:44:48", -- 早戻し
  STOP         = "10:44:45", -- 停止
  FAST_FORWARD = "10:44:49", -- 早送り
  PAUSE        = "10:44:46", -- 静止
  -- SKIP_30S     = "", -- 30秒送り

  -- リモコンにない操作
  POWER_ON  = "10:44:6D",
  POWER_OFF = "10:44:6C",
  HDMI_1    = "1F:82:10:00",
  HDMI_2    = "1F:82:20:00",
}

return BUTTONS
